ArchivosTexto/TramaSeguridad2.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gsa="http://magicsoftware.com/wsdl/com/magicsoftware/magicxpi/favoritafruit/GSAInterfaceWS/">
   <soapenv:Header/>
   <soapenv:Body>
      <gsa:getPerfilProgControles>
         <gsa:requestBean>
            <gsa:token>eyJraWQiOiJTUkJQMDBGTTAwIiwidHlwIjoiSldUIiwiYWxnIjoiUlMyNTYifQ.eyJhdWQiOiJhdWQtc2luZXJnaWEiLCJzdWIiOiJwc2luZXJnaWFfdXNsIiwiZnVsbF9uYW1lIjoiVXN1YXJpbyBkZSBzZXJ2aWNpbyBpbnRlZ3JhY2nDs24gU2luZXJnaWEiLCJhdXRoX3RpbWUiOjE3MjU4OTE5NzY1OTEsImlzcyI6Imh0dHBzOi8vU1JCUDAwRk0wMDo0NDMiLCJleHAiOjE3MjU4OTI1NzYsImlhdCI6MTcyNTg5MTk3Nn0.cOU5rTmCxEQFGGwSkVX_IHOeFDR4HH7cWV7E61O22h_TyazbiPoCc-fndG0YvR_miopAeSzAiElr4xjCfAKtSajxrObLOLxPgJdinO2dI6fuXXTrHyS9wUR8k9wP2fiEV3YsdAZ3P6A8KTsAf9g1Oh4g_77FaESJab_H9yOs_QjCEZwElmQ6vu-8zeW9fyixhQ5rlsBbbw6Nu_M9U18128pCoac8Pv2sorjrdEtYWWntxv21cdOdwifjagRvFZZ8ScZflogXPVCt2lAThPjH9aWic_NccB7tvYcmmcqXraBiFqnbAutzbUxZoDNClmPXm4aUNsOpBqjmuQRHBnOmhA</gsa:token>
            <gsa:environment>db_seguridad</gsa:environment>
            <gsa:scg_usu_codigo>dtacalva</gsa:scg_usu_codigo>
            <gsa:scg_per_codigo>01</gsa:scg_per_codigo>
            <gsa:scg_app_codigo>48</gsa:scg_app_codigo>
         </gsa:requestBean>
      </gsa:getPerfilProgControles>
   </soapenv:Body>
</soapenv:Envelope>

=====================================================
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <getPerfilProgControlesResponse xmlns="http://magicsoftware.com/wsdl/com/magicsoftware/magicxpi/favoritafruit/GSAInterfaceWS/">
         <response>
            <getPerfilProControlesBean>
               <scg_prg_codigo>48016000000</scg_prg_codigo>
               <scg_prg_descripcion>SIN Consultas</scg_prg_descripcion>
               <scg_prg_objeto/>
               <scg_prg_programa/>
               <scg_prg_path/>
               <scg_acc_nuevo>0</scg_acc_nuevo>
               <scg_acc_modificar>0</scg_acc_modificar>
               <scg_acc_anular>0</scg_acc_anular>
               <scg_acc_procesar>0</scg_acc_procesar>
               <scg_acc_imprimir>0</scg_acc_imprimir>
               <scg_acc_consultar>0</scg_acc_consultar>
               <scg_per_codigo/>
               <scg_prgcont_codigo/>
               <scg_prgcont_codigo_control/>
               <scg_acc_prgcont_modificar>0</scg_acc_prgcont_modificar>
               <scg_acc_prgcont_visualizar>0</scg_acc_prgcont_visualizar>
               <scg_acc_prgcont_habilitar>0</scg_acc_prgcont_habilitar>
               <message>OK.</message>
            </getPerfilProControlesBean>
            <getPerfilProControlesBean>
               <scg_prg_codigo>48015200000</scg_prg_codigo>
               <scg_prg_descripcion>SAM Especificaciones</scg_prg_descripcion>
               <scg_prg_objeto>sin_especificaciones_caja</scg_prg_objeto>
               <scg_prg_programa>sin_especificaciones_caja</scg_prg_programa>
               <scg_prg_path/>
               <scg_acc_nuevo>1</scg_acc_nuevo>
               <scg_acc_modificar>1</scg_acc_modificar>
               <scg_acc_anular>1</scg_acc_anular>
               <scg_acc_procesar>1</scg_acc_procesar>
               <scg_acc_imprimir>1</scg_acc_imprimir>
               <scg_acc_consultar>1</scg_acc_consultar>
               <scg_per_codigo/>
               <scg_prgcont_codigo/>
               <scg_prgcont_codigo_control/>
               <scg_acc_prgcont_modificar>0</scg_acc_prgcont_modificar>
               <scg_acc_prgcont_visualizar>0</scg_acc_prgcont_visualizar>
               <scg_acc_prgcont_habilitar>0</scg_acc_prgcont_habilitar>
               <message>OK.</message>
            </getPerfilProControlesBean>
            <getPerfilProControlesBean>
               <scg_prg_codigo>48015100000</scg_prg_codigo>
               <scg_prg_descripcion>SAM Catalogos</scg_prg_descripcion>
               <scg_prg_objeto>sin_catalogo_especificaciones</scg_prg_objeto>
               <scg_prg_programa>sin_catalogo_especificaciones</scg_prg_programa>
               <scg_prg_path/>
               <scg_acc_nuevo>1</scg_acc_nuevo>
               <scg_acc_modificar>1</scg_acc_modificar>
               <scg_acc_anular>1</scg_acc_anular>
               <scg_acc_procesar>1</scg_acc_procesar>
               <scg_acc_imprimir>1</scg_acc_imprimir>
               <scg_acc_consultar>1</scg_acc_consultar>
               <scg_per_codigo>01</scg_per_codigo>
               <scg_prgcont_codigo>CBO</scg_prgcont_codigo>
               <scg_prgcont_codigo_control>004</scg_prgcont_codigo_control>
               <scg_acc_prgcont_modificar>1</scg_acc_prgcont_modificar>
               <scg_acc_prgcont_visualizar>1</scg_acc_prgcont_visualizar>
               <scg_acc_prgcont_habilitar>1</scg_acc_prgcont_habilitar>
               <message>OK.</message>
            </getPerfilProControlesBean>
            <getPerfilProControlesBean>
               <scg_prg_codigo>48015100000</scg_prg_codigo>
               <scg_prg_descripcion>SAM Catalogos</scg_prg_descripcion>
               <scg_prg_objeto>sin_catalogo_especificaciones</scg_prg_objeto>
               <scg_prg_programa>sin_catalogo_especificaciones</scg_prg_programa>
               <scg_prg_path/>
               <scg_acc_nuevo>1</scg_acc_nuevo>
               <scg_acc_modificar>1</scg_acc_modificar>
               <scg_acc_anular>1</scg_acc_anular>
               <scg_acc_procesar>1</scg_acc_procesar>
               <scg_acc_imprimir>1</scg_acc_imprimir>
               <scg_acc_consultar>1</scg_acc_consultar>
               <scg_per_codigo>01</scg_per_codigo>
               <scg_prgcont_codigo>TXT</scg_prgcont_codigo>
               <scg_prgcont_codigo_control>001</scg_prgcont_codigo_control>
               <scg_acc_prgcont_modificar>1</scg_acc_prgcont_modificar>
               <scg_acc_prgcont_visualizar>1</scg_acc_prgcont_visualizar>
               <scg_acc_prgcont_habilitar>1</scg_acc_prgcont_habilitar>
               <message>OK.</message>
            </getPerfilProControlesBean>
            <getPerfilProControlesBean>
               <scg_prg_codigo>48015100000</scg_prg_codigo>
               <scg_prg_descripcion>SAM Catalogos</scg_prg_descripcion>
               <scg_prg_objeto>sin_catalogo_especificaciones</scg_prg_objeto>
               <scg_prg_programa>sin_catalogo_especificaciones</scg_prg_programa>
               <scg_prg_path/>
               <scg_acc_nuevo>1</scg_acc_nuevo>
               <scg_acc_modificar>1</scg_acc_modificar>
               <scg_acc_anular>1</scg_acc_anular>
               <scg_acc_procesar>1</scg_acc_procesar>
               <scg_acc_imprimir>1</scg_acc_imprimir>
               <scg_acc_consultar>1</scg_acc_consultar>
               <scg_per_codigo>01</scg_per_codigo>
               <scg_prgcont_codigo>TXT</scg_prgcont_codigo>
               <scg_prgcont_codigo_control>002</scg_prgcont_codigo_control>
               <scg_acc_prgcont_modificar>1</scg_acc_prgcont_modificar>
               <scg_acc_prgcont_visualizar>1</scg_acc_prgcont_visualizar>
               <scg_acc_prgcont_habilitar>1</scg_acc_prgcont_habilitar>
               <message>OK.</message>
            </getPerfilProControlesBean>
            <getPerfilProControlesBean>
               <scg_prg_codigo>48015100000</scg_prg_codigo>
               <scg_prg_descripcion>SAM Catalogos</scg_prg_descripcion>
               <scg_prg_objeto>sin_catalogo_especificaciones</scg_prg_objeto>
               <scg_prg_programa>sin_catalogo_especificaciones</scg_prg_programa>
               <scg_prg_path/>
               <scg_acc_nuevo>1</scg_acc_nuevo>
               <scg_acc_modificar>1</scg_acc_modificar>
               <scg_acc_anular>1</scg_acc_anular>
               <scg_acc_procesar>1</scg_acc_procesar>
               <scg_acc_imprimir>1</scg_acc_imprimir>
               <scg_acc_consultar>1</scg_acc_consultar>
               <scg_per_codigo>01</scg_per_codigo>
               <scg_prgcont_codigo>TXT</scg_prgcont_codigo>
               <scg_prgcont_codigo_control>005</scg_prgcont_codigo_control>
               <scg_acc_prgcont_modificar>1</scg_acc_prgcont_modificar>
               <scg_acc_prgcont_visualizar>1</scg_acc_prgcont_visualizar>
               <scg_acc_prgcont_habilitar>1</scg_acc_prgcont_habilitar>
               <message>OK.</message>
            </getPerfilProControlesBean>
            <getPerfilProControlesBean>
               <scg_prg_codigo>48015100000</scg_prg_codigo>
               <scg_prg_descripcion>SAM Catalogos</scg_prg_descripcion>
               <scg_prg_objeto>sin_catalogo_especificaciones</scg_prg_objeto>
               <scg_prg_programa>sin_catalogo_especificaciones</scg_prg_programa>
               <scg_prg_path/>
               <scg_acc_nuevo>1</scg_acc_nuevo>
               <scg_acc_modificar>1</scg_acc_modificar>
               <scg_acc_anular>1</scg_acc_anular>
               <scg_acc_procesar>1</scg_acc_procesar>
               <scg_acc_imprimir>1</scg_acc_imprimir>
               <scg_acc_consultar>1</scg_acc_consultar>
               <scg_per_codigo>01</scg_per_codigo>
               <scg_prgcont_codigo>TXT</scg_prgcont_codigo>
               <scg_prgcont_codigo_control>006</scg_prgcont_codigo_control>
               <scg_acc_prgcont_modificar>1</scg_acc_prgcont_modificar>
               <scg_acc_prgcont_visualizar>1</scg_acc_prgcont_visualizar>
               <scg_acc_prgcont_habilitar>1</scg_acc_prgcont_habilitar>
               <message>OK.</message>
            </getPerfilProControlesBean>
            <getPerfilProControlesBean>
               <scg_prg_codigo>48015100000</scg_prg_codigo>
               <scg_prg_descripcion>SAM Catalogos</scg_prg_descripcion>
               <scg_prg_objeto>sin_catalogo_especificaciones</scg_prg_objeto>
               <scg_prg_programa>sin_catalogo_especificaciones</scg_prg_programa>
               <scg_prg_path/>
               <scg_acc_nuevo>1</scg_acc_nuevo>
               <scg_acc_modificar>1</scg_acc_modificar>
               <scg_acc_anular>1</scg_acc_anular>
               <scg_acc_procesar>1</scg_acc_procesar>
               <scg_acc_imprimir>1</scg_acc_imprimir>
               <scg_acc_consultar>1</scg_acc_consultar>
               <scg_per_codigo>01</scg_per_codigo>
               <scg_prgcont_codigo>TXT</scg_prgcont_codigo>
               <scg_prgcont_codigo_control>007</scg_prgcont_codigo_control>
               <scg_acc_prgcont_modificar>1</scg_acc_prgcont_modificar>
               <scg_acc_prgcont_visualizar>1</scg_acc_prgcont_visualizar>
               <scg_acc_prgcont_habilitar>1</scg_acc_prgcont_habilitar>
               <message>OK.</message>
            </getPerfilProControlesBean>
            <getPerfilProControlesBean>
               <scg_prg_codigo>48015100000</scg_prg_codigo>
               <scg_prg_descripcion>SAM Catalogos</scg_prg_descripcion>
               <scg_prg_objeto>sin_catalogo_especificaciones</scg_prg_objeto>
               <scg_prg_programa>sin_catalogo_especificaciones</scg_prg_programa>
               <scg_prg_path/>
               <scg_acc_nuevo>1</scg_acc_nuevo>
               <scg_acc_modificar>1</scg_acc_modificar>
               <scg_acc_anular>1</scg_acc_anular>
               <scg_acc_procesar>1</scg_acc_procesar>
               <scg_acc_imprimir>1</scg_acc_imprimir>
               <scg_acc_consultar>1</scg_acc_consultar>
               <scg_per_codigo>01</scg_per_codigo>
               <scg_prgcont_codigo>TXT</scg_prgcont_codigo>
               <scg_prgcont_codigo_control>008</scg_prgcont_codigo_control>
               <scg_acc_prgcont_modificar>1</scg_acc_prgcont_modificar>
               <scg_acc_prgcont_visualizar>0</scg_acc_prgcont_visualizar>
               <scg_acc_prgcont_habilitar>0</scg_acc_prgcont_habilitar>
               <message>OK.</message>
            </getPerfilProControlesBean>
            <getPerfilProControlesBean>
               <scg_prg_codigo>48015000000</scg_prg_codigo>
               <scg_prg_descripcion>SIN Configuraciones</scg_prg_descripcion>
               <scg_prg_objeto/>
               <scg_prg_programa/>
               <scg_prg_path/>
               <scg_acc_nuevo>0</scg_acc_nuevo>
               <scg_acc_modificar>0</scg_acc_modificar>
               <scg_acc_anular>0</scg_acc_anular>
               <scg_acc_procesar>0</scg_acc_procesar>
               <scg_acc_imprimir>0</scg_acc_imprimir>
               <scg_acc_consultar>0</scg_acc_consultar>
               <scg_per_codigo/>
               <scg_prgcont_codigo/>
               <scg_prgcont_codigo_control/>
               <scg_acc_prgcont_modificar>0</scg_acc_prgcont_modificar>
               <scg_acc_prgcont_visualizar>0</scg_acc_prgcont_visualizar>
               <scg_acc_prgcont_habilitar>0</scg_acc_prgcont_habilitar>
               <message>OK.</message>
            </getPerfilProControlesBean>
            <getPerfilProControlesBean>
               <scg_prg_codigo>48014000000</scg_prg_codigo>
               <scg_prg_descripcion>SIN Cupos</scg_prg_descripcion>
               <scg_prg_objeto/>
               <scg_prg_programa/>
               <scg_prg_path/>
               <scg_acc_nuevo>0</scg_acc_nuevo>
               <scg_acc_modificar>0</scg_acc_modificar>
               <scg_acc_anular>0</scg_acc_anular>
               <scg_acc_procesar>0</scg_acc_procesar>
               <scg_acc_imprimir>0</scg_acc_imprimir>
               <scg_acc_consultar>0</scg_acc_consultar>
               <scg_per_codigo/>
               <scg_prgcont_codigo/>
               <scg_prgcont_codigo_control/>
               <scg_acc_prgcont_modificar>0</scg_acc_prgcont_modificar>
               <scg_acc_prgcont_visualizar>0</scg_acc_prgcont_visualizar>
               <scg_acc_prgcont_habilitar>0</scg_acc_prgcont_habilitar>
               <message>OK.</message>
            </getPerfilProControlesBean>
            <getPerfilProControlesBean>
               <scg_prg_codigo>48013000000</scg_prg_codigo>
               <scg_prg_descripcion>SIN Despachos</scg_prg_descripcion>
               <scg_prg_objeto/>
               <scg_prg_programa/>
               <scg_prg_path/>
               <scg_acc_nuevo>0</scg_acc_nuevo>
               <scg_acc_modificar>0</scg_acc_modificar>
               <scg_acc_anular>0</scg_acc_anular>
               <scg_acc_procesar>0</scg_acc_procesar>
               <scg_acc_imprimir>0</scg_acc_imprimir>
               <scg_acc_consultar>0</scg_acc_consultar>
               <scg_per_codigo/>
               <scg_prgcont_codigo/>
               <scg_prgcont_codigo_control/>
               <scg_acc_prgcont_modificar>0</scg_acc_prgcont_modificar>
               <scg_acc_prgcont_visualizar>0</scg_acc_prgcont_visualizar>
               <scg_acc_prgcont_habilitar>0</scg_acc_prgcont_habilitar>
               <message>OK.</message>
            </getPerfilProControlesBean>
            <getPerfilProControlesBean>
               <scg_prg_codigo>48012000000</scg_prg_codigo>
               <scg_prg_descripcion>SIN Naviero</scg_prg_descripcion>
               <scg_prg_objeto/>
               <scg_prg_programa/>
               <scg_prg_path/>
               <scg_acc_nuevo>0</scg_acc_nuevo>
               <scg_acc_modificar>0</scg_acc_modificar>
               <scg_acc_anular>0</scg_acc_anular>
               <scg_acc_procesar>0</scg_acc_procesar>
               <scg_acc_imprimir>0</scg_acc_imprimir>
               <scg_acc_consultar>0</scg_acc_consultar>
               <scg_per_codigo/>
               <scg_prgcont_codigo/>
               <scg_prgcont_codigo_control/>
               <scg_acc_prgcont_modificar>0</scg_acc_prgcont_modificar>
               <scg_acc_prgcont_visualizar>0</scg_acc_prgcont_visualizar>
               <scg_acc_prgcont_habilitar>0</scg_acc_prgcont_habilitar>
               <message>OK.</message>
            </getPerfilProControlesBean>
            <getPerfilProControlesBean>
               <scg_prg_codigo>48011000000</scg_prg_codigo>
               <scg_prg_descripcion>SIN Pedidos</scg_prg_descripcion>
               <scg_prg_objeto/>
               <scg_prg_programa/>
               <scg_prg_path/>
               <scg_acc_nuevo>0</scg_acc_nuevo>
               <scg_acc_modificar>0</scg_acc_modificar>
               <scg_acc_anular>0</scg_acc_anular>
               <scg_acc_procesar>0</scg_acc_procesar>
               <scg_acc_imprimir>0</scg_acc_imprimir>
               <scg_acc_consultar>0</scg_acc_consultar>
               <scg_per_codigo/>
               <scg_prgcont_codigo/>
               <scg_prgcont_codigo_control/>
               <scg_acc_prgcont_modificar>0</scg_acc_prgcont_modificar>
               <scg_acc_prgcont_visualizar>0</scg_acc_prgcont_visualizar>
               <scg_acc_prgcont_habilitar>0</scg_acc_prgcont_habilitar>
               <message>OK.</message>
            </getPerfilProControlesBean>
         </response>
      </getPerfilProgControlesResponse>
   </soapenv:Body>
</soapenv:Envelope>